Enums/СтатусыАкцизныхМарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыАкцизныхМарок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВНаличии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПостановкеНаБаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВНаличииКОтменеПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПостановкеНаБалансКОтменеПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезервеКОтменеПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЧтенияСтатуса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыДокументовЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктТТНОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктТТНПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПостановкиНаБалансВРегистр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПостановкиНаБалансВРегистр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПостановкиНаБалансВРегистр3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктТТНРасхождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСписанияИзРегистра1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСписанияИзРегистра2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСписанияИзРегистра3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзРегистра2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАлкогольнойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияАктаСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросДанныхОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСправки1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСправки2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОФорматеОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияПроведенЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияПолученЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросАлкогольнойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросДанныхОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОстатковВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЗапросаНаОтменуПроведенияТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОстатковВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияАктаРасхожденийОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЗапросаНаОтменуПроведенияТТНОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРегистр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияАктаРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияАктаРасхожденийПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОРегистрацииДвиженияТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаДвиженияМеждуРегистрами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаДвиженияПоСправке2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаИнформацияОбОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаНеобработанныеТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОбработанныеЧеки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОстаткиВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОстаткиВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОстаткиВРегистре3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаДвиженияПоСправке2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаНеобработанныеТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОбработанныеЧеки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОстаткиВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОстаткиВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОстаткиВРегистре3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросСправки1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросСправки2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаИсторияСправок2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаИсторияСправок2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсторияСправок2ПоТТН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/АкцизныеМаркиЕГАИСКлиентСерверПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// В функции требуется пересчитать количество введенных акцизных марок в количество единиц выбранной упаковки.
//
// Параметры:
//  Упаковка - ОпределяемыйТип.Упаковка - выбранная упаковка,
//  КоличествоАкцизныхМарок - Число - количество введенных акцизных марок,
//  КэшированныеЗначения - Струкктура, Неопределено - кэш формы документа.
//
// Возвращаемое значение:
//  Число - количество акцизных марок в единицах упаковки.
//
Функция КоличествоЕдиницАкцизныхМарок(Упаковка, КоличествоАкцизныхМарок, КэшированныеЗначения) Экспорт
	
	//++ НЕ ЕГАИС
	Возврат КоличествоАкцизныхМарок;
	//-- НЕ ЕГАИС
	
КонецФункции

Процедура ЗаполнитьПараметрыСканированияАкцизныхМарок(Параметры, Форма) Экспорт

	//++ НЕ ЕГАИС
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЧекККМВозврат") Тогда
		
		ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМВозврат(Параметры, Форма.Объект.ОрганизацияЕГАИС, Ложь);
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЧекККМ") Тогда
		
		ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМ(Параметры, Форма.Объект.ОрганизацияЕГАИС, Ложь);
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "ОбщаяФорма.ПроверкаЗаполненияДокументов") Тогда
		
		Если ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			
			ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМ(Параметры, Форма.ОрганизацияЕГАИС, Истина);
			
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			
			ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМВозврат(Параметры, Форма.ОрганизацияЕГАИС, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- НЕ ЕГАИС
	
КонецПроцедуры

#КонецОбласти

//++ НЕ ЕГАИС
#Область СлужебныеПроцедурыИФункцииУТ

Функция ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМ(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества)
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ВНаличии"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Продажа";
	
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьПараметрыСканированияАкцизныхМарокЧекККМВозврат(Параметры, ОрганизацияЕГАИС, ПроверкаКоличества)
	
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.Реализована"));
	Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
	
	Параметры.КонтрольАкцизныхМарок         = Истина;
	Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
	Параметры.ОперацияКонтроляАкцизныхМарок = "Возврат";
	Параметры.ОрганизацияЕГАИС              = ОрганизацияЕГАИС;
	Параметры.СоздаватьШтрихкодУпаковки     = Истина;
	
	Если ПроверкаКоличества Тогда
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	Иначе
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("СтавкаНДС");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
		Параметры.КлючевыеРеквизиты.Добавить("Продавец");
		Параметры.КлючевыеРеквизиты.Добавить("Помещение");
		Параметры.КлючевыеРеквизиты.Добавить("НоменклатураНабора");
		Параметры.КлючевыеРеквизиты.Добавить("ХарактеристикаНабора");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
//-- НЕ ЕГАИС
